app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "raja@gmail.com"]]
---
  def create
    @users = User.find_by(email: params[:session][:email])