app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "users" SET "name" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "ureg"], ["email", "dfagf@gmail.com"], ["updated_at", "2020-01-12 10:40:56.068470"], ["id", 2]]
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])